{
  "ver": "Factions_9e_01",
  "name": "Faction Specific",
  "factions": [

	{ "faction": "SPACE MARINES",
      "name": "Space Marines",
      "categories": [
        {
          "name": "Purge the Enemy",
          "objectives": [
            {
              "id": "EW.02.01.01",
              "name": "Codex Warfare",
              "description": "[i]End Game Objective[/i]\nScore victory points as follows:\n- Score 1 victory point at the end of the battle (to a maximum of 5 victory points) for each enemy unit that was destroyed as the result of an attack made with a Heavy or Grenade weapon by an ADEPTUS ASTARTES unit from your army while the Devastator Doctrine was active for your army.\n- Score 1 victory point at the end of the battle (to a maximum of 5 victory points) for each enemy unit that was destroyed as the result of an attack made with a Rapid Fire or Assault weapon by an ADEPTUS ASTARTES unit from your army while the Tactical Doctrine was active for your army.\n- Score 1 victory point at the end of the battle (to a maximum of 5 victory points) for each enemy unit that was destroyed as the result of an attack made with a Pistol or Melee weapon by an ADEPTUS ASTARTES unit from your army while the Assault Doctrine was active for your army."
            }
          ]
        },
		{
          "name": "Battlefield Supremacy",
          "objectives": [
            {
              "id": "EW.02.02.01",
              "name": "Shock Tactics",
              "description": "[i]Progressive Objective[/i]\nScore 3 victory points at the end of the battle round if you control one or more objective markers that were controlled by your opponent at the start of the battle round, and an ADEPTUS ASTARTES unit from your army is within range of that objective marker."
            }
          ]
        },
        {
          "name": "No Mercy, No Respite",
          "objectives": [
            {
              "id": "EW.02.03.01",
              "name": "Oath of Moment",
              "description": "[i]Progressive Objective[/i]\nScore victory points at the end of each battle round for achieving the following three Oaths:\n- Oath of Valour: Score 1 victory point if any CHARACTER, VEHICLE or MONSTER unit was destroyed by an ADEPTUS ASTARTES unit from your army during that battle round.\n- Oath of Honour: Score 1 victory point at the end of the battle round so long as no ADEPTUS ASTARTES units from your army failed a Morale test, and provided no ADEPTUS ASTARTES units from your army Fell Back during that battle round.\n- Oath of Duty: Score 2 victory points at the end of the battle round if an ADEPTUS ASTARTES unit from your army is wholly within 6\" of the centre of the battlefield."
            }
          ]
        } 
      ]
    }
		
      ]
    }
  ]
}
