{
  "ver": "Factions_9e_01",
  "name": "Faction Specific",
  "factions": [

	{ "faction": "SPACE MARINES",
      "name": "Space Marines",
      "categories": [
        {
          "name": "Purge the Enemy",
          "objectives": [
            {
              "id": "EW.02.01.01",
              "name": "Codex Warfare",
              "description": "[i]End Game Objective[/i]\nScore victory points as follows:\n- Score 1 victory point at the end of the battle (to a maximum of 5 victory points) for each enemy unit that was destroyed as the result of an attack made with a Heavy or Grenade weapon by an ADEPTUS ASTARTES unit from your army while the Devastator Doctrine was active for your army.\n- Score 1 victory point at the end of the battle (to a maximum of 5 victory points) for each enemy unit that was destroyed as the result of an attack made with a Rapid Fire or Assault weapon by an ADEPTUS ASTARTES unit from your army while the Tactical Doctrine was active for your army.\n- Score 1 victory point at the end of the battle (to a maximum of 5 victory points) for each enemy unit that was destroyed as the result of an attack made with a Pistol or Melee weapon by an ADEPTUS ASTARTES unit from your army while the Assault Doctrine was active for your army."
            }
          ]
        },
		{
          "name": "Battlefield Supremacy",
          "objectives": [
            {
              "id": "EW.02.02.01",
              "name": "Shock Tactics",
              "description": "[i]Progressive Objective[/i]\nScore 3 victory points at the end of the battle round if you control one or more objective markers that were controlled by your opponent at the start of the battle round, and an ADEPTUS ASTARTES unit from your army is within range of that objective marker."
            }
          ]
        },
        {
          "name": "No Mercy, No Respite",
          "objectives": [
            {
              "id": "EW.02.03.01",
              "name": "Oath of Moment",
              "description": "[i]Progressive Objective[/i]\nScore victory points at the end of each battle round for achieving the following three Oaths:\n- Oath of Valour: Score 1 victory point if any CHARACTER, VEHICLE or MONSTER unit was destroyed by an ADEPTUS ASTARTES unit from your army during that battle round.\n- Oath of Honour: Score 1 victory point at the end of the battle round so long as no ADEPTUS ASTARTES units from your army failed a Morale test, and provided no ADEPTUS ASTARTES units from your army Fell Back during that battle round.\n- Oath of Duty: Score 2 victory points at the end of the battle round if an ADEPTUS ASTARTES unit from your army is wholly within 6\" of the centre of the battlefield."
            }
          ]
        } 
      ]
    },
	  ,
	{ "faction": "NECRONS",
      "name": "Necrons",
      "categories": [
        {
          "name": "Battlefield Supremacy",
          "objectives": [
            {
              "id": "EW.03.01.01",
              "name": "Purge the Vermin",
              "description": "[i]Progressive Objective[/i]\nScore 2 victory points at the end of your turn for each table quarter that does not have any enemy units (excluding AIRCRAFT units) wholly within it. This objective cannot be scored in the first battle round."
			  }
          ]
        },
		{
          "name": "Battlefield Supremacy",
          "objectives": [
            {
              "id": "EW.03.02.01",
              "name": "The Treasure of Aeons",
              "description": "[i]Progressive Objective[/i]\nIf you selected this secondary objective, then after both sides have finished deploying, your opponent selects 3 objective markers on the battlefield. Score a number of victory points at the end of your turn if you control one or more of those objective markers, as listed:\n- 1 marker, 2 VP\n- 2 markers, 3 VP\n- 3 markers, 5 VP"
			  }
          ]
        },
        {
          "name": "No Mercy, No Respite",
          "objectives": [
            {
              "id": "EW.03.03.01",
              "name": "Code of Combat",
              "description": "[i]End Game Objective[/i]\nScore 3 victory points at the end of the battle for each enemy unit that was destroyed by a NECRONS NOBLE unit from your army."
			  }
          ]
        },
	{
          "name": "Shadow Operations",
          "objectives": [
            {
              "id": "EW.03.04.01",
              "name": "Ancient Machineries",
              "description": "[i]Progressive Objective[/i]\nIf you selected this secondary objective, then after both sides have finished deploying, starting with your opponent, the players alternate selecting objective markers that are not within any player’s deployment zone to be Ancient Machinery objective markers, until three objective markers have been selected (if there are only one or two such objective markers, then only those objective markers are Ancient Machinery objective markers). Score 3 victory points each time a NECRONS CORE or NECRONS CANOPTEK units from your army completes the Awaken Ancient Machinery action.",
			  "actions": [
                {
                  "id": "EW.03.04.01a",
                  "name": "Awaken Ancient Machinery (Action)",
                  "description": "[i]Action[/i]\nAt the end of your Movement phase, one or more NECRONS CORE or NECRONS CANOPTEK units from your army can start to perform this action. Each unit from your army that starts to perform this action must be in range of a different Ancient Machinery objective marker. A unit cannot start this action while there are any enemy units (excluding AIRCRAFT) in range of the same objective marker. Ihe action is completed at the end of your next Command phase, provided the unit attempting that action is still within range of that Ancient Machinery objective marker."
				  }
              ]
			}
          ]
        }		
      ]
    }
		
      ]
    }
  ]
}
